let apartments_VIP = [
  {
    name: "شقة بالمهندسين V-301",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      " شقة بالمهندسين – شارع المدينة المنورة   الدور الرابع، 3 أسانسير   3 غرف، 2 ريسبشن، حمام، مطبخ متكامل، وبلكونة ",
  },
  {
    name: " شقة بالمهندسين V-302",
    available: true,
    price: 109,
    old_Price: 130,
    details:
      "شقة بالمهندسين – شارع جزيرة العرب وجامعة الدول العربية، الدور السادس، 2 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة  بالمهندسين V-303",
    available: true,
    price: 119,
    old_Price: 140,
    details:
      "شقة في المهندسين – شارع حماد (متفرع من شارع جامعة الدول العربية)، تقع في الدور الرابع داخل عمارة راقية بها 3 أسانسير، تتكون من 3 غرف نوم، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },

  {
    name: "شقة بالمهندسين V-304",
    available: true,
    price: 109,
    old_Price: 130,
    details:
      "شقة بالمهندسين – شارع مصدق، الدور السادس، 3 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ، وبلكونة",
  },
  {
    name: "شقة علي كورنيش المعادي V-305",
    available: true,
    price: 199,
    old_Price: 220,
    details:
      "شقة بكورنيش المعادي – الدور العاشر، 3 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-306",
    available: true,
    price: 124,
    old_Price: 145,
    details:
      "شقة بالمهندسين – شارع البطل أحمد عبد العزيز، الدور الخامس، 3 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة على كورنيش المعادي V-307",
    available: true,
    price: 199,
    old_Price: 220,
    details:
      "شقة على كورنيش المعادي – الدور العاشر، 3 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة على كورنيش المعادي V-308",
    available: true,
    price: 119,
    old_Price: 140,
    details:
      "شقة على كورنيش المعادي – الدور العاشر، 3 أسانسير، 3 غرف، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-309",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور الخامس، 4 أسانسير، 3 غرف، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-310",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور الرابع، 2 أسانسير، 3 غرف، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بجزيرة العرب V-311",
    available: true,
    price: 149,
    old_Price: 170,
    details:
      "شقة بجزيرة العرب – شارع جامعة الدول الرئيسي، الدور السابع، 4 أسانسير، 3 غرف، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-312",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور الثالث عشر، 2 أسانسير، 3 غرف، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-313",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور الخامس، 2 أسانسير، 2 غرفة، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-202",
    available: true,
    price: 64,
    old_Price: 85,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور السابع، 4 أسانسير، 2 غرفة، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بالمهندسين V-203",
    available: true,
    price: 69,
    old_Price: 90,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، الدور التاسع، 4 أسانسير، 2 غرفة، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بكورنيش المعادي V-204",
    available: true,
    price: 119,
    old_Price: 140,
    details:
      "شقة بكورنيش المعادي – الدور الحادي عشر، 3 أسانسير، 2 غرفة، 2 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "شقة بجزيرة العرب V-205",
    available: true,
    price: 119,
    old_Price: 140,
    details:
      "شقة جزيرة العرب – شارع جامعة الدول الرئيسي، الدور الثامن، 2 أسانسير، 2 غرفة (4 سراير)، 3 ريسبشن، 2 حمام، مطبخ متكامل، وبلكونة",
  },
  {
    name: "استوديو بالمهندسين V-101",
    available: true,
    price: 69,
    old_Price: 90,
    details:
      "أستوديو للإيجار بالمهندسين – تفرعات شارع شهاب، الدور الرابع، 2 أسانسير، بلكونة، غرفة، ريسبشن، سفرة، كل مستلزمات المطبخ، تكييفات + دفايات",
  },
  {
    name: "استوديو بالمهندسين V-102",
    available: true,
    price: 64,
    old_Price: 85,
    details:
      "استوديو بالمهندسين – جامعة الدول أمام نادي الزمالك والترسانة، شارع 26 يوليو، الدور الثامن، 8 أسانسير، غرفة + بلكونة + مطبخ متكامل + ريسبشن + فرش فندقي + حمام + واي فاي",
  },
  {
    name: "ميدان لبنان V-314",
    available: true,
    price: 74,
    old_Price: 100,
    details:
      "شقة بميدان لبنان – شارع إسراء المعلمين بجوار فرحات، 3 غرف، 3 حمام، قريبة من جميع الخدمات والمطاعم والكافيهات والسوبر ماركت",
  },
  {
    name: "شقة بالمهندسين V-315",
    available: true,
    price: 59,
    old_Price: 80,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، 3 غرف (منهم غرفة ماستر)، 2 حمام، بها كل الخدمات، وبجوار جميع البنوك والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بالمهندسين V-316",
    available: true,
    price: 64,
    old_Price: 85,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، 3 غرف (منهم غرفة ماستر)، 2 حمام، بها كل الخدمات، وبجوار جميع البنوك، والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بشارع النيل – بجوار الفورسيزون  V-317",
    available: true,
    price: 349,
    old_Price: 380,
    details:
      "شقة بشارع النيل – بجوار الفورسيزون، 3 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع لبنان الرئيسي V-318",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، 3 غرف (منهم غرفة ماستر)، 2 حمام، بلكونة كبيرة جدًا، فرش جديد بالكامل (أول ساكن)، بها كل الخدمات، وبجوار جميع البنوك، والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بالمهندسين – ميدان لبنان V-319",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة بالمهندسين – ميدان لبنان، 3 غرف (منهم غرفة ماستر)، 2 حمام، فرش جديد بالكامل (أول ساكن)، متكاملة الخدمات، وبالقرب من جميع المطاعم، والكافيهات، والبرندات العالمية",
  },
  {
    name: "شقة فاخرة بالمهندسين – ميدان لبنان V-320",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة فاخرة بالمهندسين – ميدان لبنان، 3 غرف (منهم غرفة ماستر)، 2 حمام، أول ساكن 😎، متكاملة الخدمات 🌟، وبالقرب من جميع المطاعم والكافيهات والبرندات العالمية 🔥",
  },
  {
    name: "شقة فاخرة بالمهندسين – ميدان لبنان V-321",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة فاخرة بالمهندسين – ميدان لبنان، 3 غرف (منهم غرفة ماستر)، 2 حمام، أول ساكن 😎، متكاملة الخدمات 🌟، بالقرب من جميع المطاعم، والكافيهات، والبرندات العالمية 🔥",
  },
  {
    name: "شقة بالدقي – شارع محيي الدين V-322",
    available: true,
    price: 119,
    old_Price: 140,
    details:
      "شقة بالدقي – شارع محيي الدين، 3 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات، والعيادات، والسوبر ماركت، والصرافة",
  },
  {
    name: "شقة بكورنيش المعادي  V-323",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة بكورنيش المعادي – 3 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-325",
    available: true,
    price: 99,
    old_Price: 120,
    details:
      "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 3 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع لبنان الرئيسي V-326",
    available: true,
    price: 74,
    old_Price: 100,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، 3 غرف (منهم غرفة ماستر)، 2 حمام، بلكونة كبيرة جدًا، فرش جديد بالكامل (أول ساكن)، بها كل الخدمات، وبجوار جميع البنوك، والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بكورنيش المعادي V-327",
    available: true,
    price: 144,
    old_Price: 170,
    details:
      "شقة بكورنيش المعادي – 3 غرف (منهم غرفة ماستر)، 3 حمام، فرش فندقي، بها كل الخدمات، ومطلة على النيل والأهرامات",
  },
  {
    name: "شقة بشارع النيل – بجوار الفورسيزون V-328",
    available: true,
    price: 349,
    old_Price: 400,
    details:
      "شقة بشارع النيل – بجوار الفورسيزون، 3 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-206",
    available: true,
    price: 99,
    old_Price: 130,
    details:
      "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-402",
    available: true,
    price: 109,
    old_Price: 150,
    details:
      "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 4 غرف، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جزيرة العرب V-403",
    available: true,
    price: 129,
    old_Price: 150,
    details:
      "شقة بالمهندسين – شارع جزيرة العرب، 4 غرف، 4 حمام، ريسبشن قطعتين، فرش جديد بالكامل (أول ساكن)، بها كل الخدمات، وبجوار جميع البنوك، والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بالمهندسين – شارع لبنان الرئيسي V-329",
    available: true,
    price: 79,
    old_Price: 100,
    details:
      "شقة بالمهندسين – شارع لبنان الرئيسي، 3 غرف (منهم غرفة ماستر)، 2 حمام، بلكونة كبيرة جدًا، فرش جديد بالكامل (أول ساكن)، بها كل الخدمات، وبالقرب من جميع البنوك، والصرافات، والسوبر ماركت، والكافيهات، والمطاعم",
  },
  {
    name: "شقة بالمهندسين – شارع لبنان V-201",
    available: true,
    price: 69,
    old_Price: 100,
    details: 
    "شقة بالمهندسين – شارع لبنان، 2 غرفة نوم، 2 حمام، ومطبخ",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-207",
    available: true,
    price: 89,
    old_Price: 120,
    details: 
    "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-208",
    available: true,
    price: 89,
    old_Price: 120,
    details: 
    "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع شهاب V-330",
    available: true,
    price: 79,
    old_Price: 110,
    details: 
    "شقة بالمهندسين – شارع شهاب، 3 غرف، فندقية بالكامل بمدخل فندقي، وبجوار جميع الخدمات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-209",
    available: true,
    price: 89,
    old_Price: 120,
    details: 
    "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-210",
    available: true,
    price: 89,
    old_Price: 120,
    details: 
    "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع جامعة الدول الرئيسي V-211",
    available: true,
    price: 89,
    old_Price: 120,
    details: 
    "شقة بالمهندسين – شارع جامعة الدول الرئيسي، 2 غرفة، 3 حمام، قريبة من جميع الخدمات، والمطاعم، والكافيهات",
  },
  {
    name: "شقة بالمهندسين – شارع طيبة V-103",
    available: true,
    price: 69,
    old_Price: 90,
    details: 
    "شقة بالمهندسين – شارع طيبة من سليمان أباظة، 1 غرفة نوم، 1 حمام",
  },
  {
    name: "شقة بالزمالك V-212",
    available: true,
    price: 79,
    old_Price: 100,
    details: 
    "شقة بالزمالك – 2 غرفة، 1 حمام",
  },
  {
    name: "شقة بالمهندسين – تقاطع شارع لبنان وجزيرة العرب V-331",
    available: true,
    price: 99,
    old_Price: 130,
    details: 
    "شقة بالمهندسين – تقاطع شارع لبنان وجزيرة العرب، 3 غرف نوم (منهم غرفة ماستر)، 3 حمام",
  },
  {
    name: "استوديو بالمهندسين  V-104",
    available: true,
    price: 69,
    old_Price: 100,
    details: "استوديو بالمهندسين – غرفة، صالة، وحمام",
  },
  {
    name: "بنتهاوس بالمهندسين  V-213",
    available: true,
    price: 109,
    old_Price: 140,
    details: "بنتهاوس بالمهندسين – إطلالة بانورامية على نادي الصيد، 2 غرفة، 3 حمام، حمام سباحة خاص",
  },
  {
    name: "استوديو بوسط البلد V-105",
    available: true,
    price: 54,
    old_Price: 80,
    details: "استوديو بوسط البلد – غرفة، وحمام"
  },
  {
    name: "شقة بالزمالك V-214",
    available: true,
    price: 99,
    old_Price: 130,
    details:"شقة بالزمالك – 2 غرفة"
  },
  {
    name: "شقة بالزمالك V-332",
    available: true,
    price: 149,
    old_Price: 180,
    details:"شقة بالزمالك – 3 غرف نوم"
  },
  {
    name: "شقة فندقية بميدان لبنان V-333",
    available: true,
    price: 69,
    old_Price: 80,
    details:"شقة فندقية بميدان لبنان المهندسين 3غرف 2حمام"
  },
];

// for (let i = 0; i < apartments.length; i++) {
//   console.log(apartments[i]);
// }

// Show Page
for (let l = 0; l < apartments_VIP.length; l++) {
  let nameElement = document.getElementById(`name-v${l + 1}`);
  if (nameElement) {
    nameElement.textContent = apartments_VIP[l].name;
  }

  let detailElement = document.getElementById(`detail-v${l + 1}`);
  if (detailElement) {
    detailElement.textContent = apartments_VIP[l].details;
  }
}
// =================================
// Create Cards For New Products
// =================================

// The Target Div
let VIP = document.querySelector(".VIP");
for (let i = 0; i < apartments_VIP.length; i++) {
  if (apartments_VIP[i].available) {
    // =================================
    // Elements of Card ^-^
    let card = document.createElement("Div");
    let link = document.createElement("a");
    let img = document.createElement("img");
    let name = document.createElement("p");
    let b_name = document.createElement("b");
    let price = document.createElement("p");
    let b_price = document.createElement("b");
    let old_price = document.createElement("p");
    let b_old_price = document.createElement("b");
    let s_old_price = document.createElement("s");
    // =================================
    // appending Elements to The Card
    link.append(img);
    name.append(b_name);
    price.append(b_price);
    old_price.append(b_old_price);
    b_old_price.append(s_old_price);
    card.append(link);
    card.append(name);
    card.append(price);
    card.append(old_price);

    // =================================
    // Add attributes to Elements and Card
    card.setAttribute("class", "card");
    card.setAttribute("id", `card-${i + 1}`);
    link.setAttribute("href", `VIP/VIP-${i + 1}.html`);
    img.setAttribute("src", `images/VIP/VIP-${i + 1}.jpeg`);
    b_name.setAttribute("id", `name-v${i + 1}`);
    b_price.setAttribute("id", `price-v${i + 1}`);
    s_old_price.setAttribute("id", `old-price-v${i + 1}`);
    // =================================
    // Add The Card To VIP Div
    if (VIP) {
      VIP.appendChild(card);
    }

    // =================================
    // Show Data about VIP
    let nameElement = document.getElementById(`name-v${i + 1}`);
    if (nameElement) {
      nameElement.textContent = apartments_VIP[i].name;
    }

    let priceElement = document.getElementById(`price-v${i + 1}`);
    if (priceElement) {
      priceElement.textContent =
        apartments_VIP[i].price +
        " $ " +
        " = " +
        apartments_VIP[i].price * 50 +
        " جنيه ";
    }

    let oldPriceElement = document.getElementById(`old-price-v${i + 1}`);
    if (oldPriceElement) {
      oldPriceElement.textContent =
        apartments_VIP[i].old_Price +
        " $ " +
        " = " +
        apartments_VIP[i].old_Price * 50 +
        " جنيه ";
    }

    let detailElement = document.getElementById(`detail-v${i + 1}`);
    if (detailElement) {
      detailElement.textContent = apartments_VIP[i].details;
    }
  } else {
    continue;
  }
}
